import torch.nn as nn

class DogNCatCNN(nn.Module):
    def __init__(self):
        super().__init__()

        self.network = nn.Sequential(
            # در اینجا ما به مدل میگیم که سه کانال رنگی همون rgb که هست رو با 16 فیلتر و اندازه هر فیلتر 3در 3 باشه 
            # درواقع مدل ما شروم مکنه چیزایی مثل لبه و خط و کناره ها رو پیدا و بفهمشون
            nn.Conv2d(3,16,3, padding=1),
            nn.ReLU(), ## نمیخوایم مقادیر منفی داشته باشه پس صفرشون میکنمی 
            nn.MaxPool2d(2), # اطلاعات مهم را ذخیره میکند اندازه کوچک تر میشود ولی این اطلاعات مهم دست نخورده میماند


            # این مورد هم همون کد بخش بالاست ولی لایه دوم هست و به برسی الگو های پیچیده تر مثل گوش و پنجه و بنی و دم و این موارد تشخیص میدهد
            nn.Conv2d(16,32,3, padding=1),
            nn.ReLU(),
            nn.MaxPool2d(2),

            nn.Conv2d(32,64,3, padding=1),
            nn.ReLU(),
            nn.MaxPool2d(2),


            # خروجی را به یک بردار که تک بعدی باشه تبدیل میکند (مثل برادرم :))
            nn.Flatten(),


            # این خت درواقع یک جور خلاصه کننده تصمیم گیرنده برای مدل ماست که اطلاعات را دریافت میکند و 256 تا از مهم ترین های ان ها  را برمی گرداند درواقع نمیخوایم مدلمان خیلی وارد جزییات شود 
            nn.Linear(64*16*16,256),
            nn.ReLU(),


            # این هم مثل کد بالا 
            nn.Linear(256,2)
        )

    def forward(self, x):
        return self.network(x)